Autodesk.Revit.DB.FabricationConfiguration.GetMaterialName(System.Int32)
Gets material name from its identifier.
matId:
The material identifier.
Returns:
The group name.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetMaterialGroup(System.Int32)
Gets material group from its identifier.
matId:
The material identifier.
Returns:
The material group.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.UnloadServices(System.Collections.Generic.IList`1{System.Int32})
Unload the specified fabrication services from the project.
serviceIds:
The ids of the fabrication services to unload.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication services can not be unloaded if they are in use currently.
-or-
Some services are not loaded yet.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication workspace is not connected and updated to source configuration, please reload and try again.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.LoadServices(System.Collections.Generic.IList`1{System.Int32})
Loads the specified fabrication services into the project.
serviceIds:
The ids of the fabrication services to load.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication workspace is not connected and updated to source configuration, please reload and try again.
-or-
this operation failed.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.SetConfiguration(Autodesk.Revit.DB.FabricationConfigurationInfo)
Set the fabrication configuration.
fabricationConfigurationInfo:
The desired fabrication configuration.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The fabrication configuration cannot be swapped because the exiting fabrication configuration has already been used in the document.
-or-
Cannot set the configuration.
Since:
2016